In [2]:
import pandas as pd

<h1>Create Two DataFrames</h1>

In [4]:
bd_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38],
    'humidity': [60, 80, 90]
})

bd_df

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90

In [5]:
usa_df = pd.DataFrame({
    'city': ['Newyork', 'Chicago', 'Oriando'],
    'temperature': [21, 14, 35],
    'humidity': [68, 65, 75]
})

usa_df

      city  temperature  humidity
0  Newyork           21        68
1  Chicago           14        65
2  Oriando           35        75

<h1>Concatenate Two DataFrame</h1>

<h3>Without changing Index</h3>

In [7]:
weather_df = pd.concat([bd_df, usa_df])
weather_df

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90
0     Newyork           21        68
1     Chicago           14        65
2     Oriando           35        75

<h3>With changing Index</h3>

In [8]:
weather_df = pd.concat([bd_df, usa_df], ignore_index=True)
weather_df

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90
3     Newyork           21        68
4     Chicago           14        65
5     Oriando           35        75

<h1>Create Additional Index using Keys</h1>

In [9]:
weather_df = pd.concat([bd_df, usa_df], keys=['BD', 'USA'])
weather_df

             city  temperature  humidity
BD  0    Dinajpur           32        60
    1       Dhaka           40        80
    2  Chittagong           38        90
USA 0     Newyork           21        68
    1     Chicago           14        65
    2     Oriando           35        75

In [11]:
weather_df.loc['BD']

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90

<h1>Column wise Concatenate</h1>

<h3>Create Two DataFrame using same cities</h3>

In [12]:
tmp_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'temperature': [32, 40, 38]
})

tmp_df

         city  temperature
0    Dinajpur           32
1       Dhaka           40
2  Chittagong           38

In [13]:
humidity_df = pd.DataFrame({
    'city': ['Dinajpur', 'Dhaka', 'Chittagong'],
    'humidity': [60, 80, 90]
})

humidity_df

         city  humidity
0    Dinajpur        60
1       Dhaka        80
2  Chittagong        90

In [14]:
df = pd.concat([tmp_df, humidity_df], axis=1)
df

         city  temperature        city  humidity
0    Dinajpur           32    Dinajpur        60
1       Dhaka           40       Dhaka        80
2  Chittagong           38  Chittagong        90

In [15]:
df = pd.concat([tmp_df, humidity_df['humidity']], axis=1)
df

         city  temperature  humidity
0    Dinajpur           32        60
1       Dhaka           40        80
2  Chittagong           38        90